Цена_товара=34
Вес_товара=4.5
Количество_денег_у_покупателя=500
print(int(Количество_денег_у_покупателя-(Цена_товара*Вес_товара)))
Название_товара='Черешня'
Цена_товара=34
Вес_товара=4.5
Количество_денег_у_покупателя=500
print('Чек', (Название_товара), (Вес_товара), "кг", (Цена_товара) ,"руб/кг", "Итого:", (Вес_товара*Цена_товара), "руб", "Внесено", (Количество_денег_у_покупателя), "руб", "Сдача:", (Количество_денег_у_покупателя-(Вес_товара*Цена_товара)), "руб" )
Цена_товара=600
Вес_товара=0.5
Количество_денег_у_покупателя=1000
print(int(Количество_денег_у_покупателя-(Цена_товара*Вес_товара)))
Название_товара='Грецкие орехи'
print('Чек', (Название_товара), (Вес_товара), "кг", (Цена_товара) ,"руб/кг", "Итого:", (Вес_товара*Цена_товара), "руб", "Внесено", (Количество_денег_у_покупателя), "руб", "Сдача:", (Количество_денег_у_покупателя-(Вес_товара*Цена_товара)), "руб" )
name=5
print('Купи конструктор! '*name)
name=4
Любимое_дело='поедая мармеладки!'
print(('Обожаю писать,', Любимое_дело)*name) #не получается вставить *name так, чтобы строка 4 раза повторилась на выводе чисто без кавычек